Revit 2027 API
MEPHiddenLineSettings.LineStyle Property
 The line style that determines how the lines of a hidden segment display at the point where the segments cross.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LineStyle { get; set; }
Public Property LineStyle As ElementId
	Get
	Set
public:
property ElementId^ LineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LineStyle : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The line style is invalid for hidden line display.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace